## Terraform Plan 📋

<details>
<summary>Show Plan</summary>

```terraform
module.eks_cluster.module.eks.data.aws_caller_identity.current[0]: Reading...
module.networking.module.vpc.data.aws_partition.current[0]: Reading...
module.eks_cluster.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks_cluster.module.eks.data.aws_partition.current[0]: Reading...
module.container_registry.aws_ecr_repository.this: Refreshing state... [id=ml-platform-api]
module.networking.data.aws_region.current: Reading...
module.networking.module.vpc.data.aws_region.current[0]: Reading...
module.eks_cluster.module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/ml-platform-dev/cluster]
module.networking.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0b28cd11901077bed]
module.eks_cluster.aws_iam_role.node_group: Refreshing state... [id=ml-platform-dev-ng-20251107084424450100000003]
module.networking.module.vpc.data.aws_region.current[0]: Read complete after 0s [id=us-west-2]
module.networking.data.aws_region.current: Read complete after 0s [id=us-west-2]
module.networking.module.vpc.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks_cluster.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.eks_cluster.module.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.security.data.aws_caller_identity.current: Reading...
module.networking.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.networking.module.vpc.data.aws_caller_identity.current[0]: Reading...
module.networking.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.eks_cluster.module.eks.aws_iam_role.this[0]: Refreshing state... [id=ml-platform-dev-cluster-20251107084424449600000002]
module.networking.module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20251107084424449300000001]
module.eks_cluster.module.eks.data.aws_caller_identity.current[0]: Read complete after 0s [id=984479408136]
module.eks_cluster.module.eks.data.aws_iam_session_context.current[0]: Reading...
module.eks_cluster.aws_iam_role_policy_attachment.node_group_amazon_eks_cni_policy: Refreshing state... [id=ml-platform-dev-ng-20251107084424450100000003/arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy]
module.eks_cluster.aws_iam_role_policy_attachment.node_group_amazon_ec2_container_registry_read_only: Refreshing state... [id=ml-platform-dev-ng-20251107084424450100000003/arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly]
module.eks_cluster.module.eks.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:sts::984479408136:assumed-role/GitHubActions-AssumeRoleForActions/GitHubActions-TF-Plan-19191527303]
module.eks_cluster.aws_iam_role_policy_attachment.node_group_amazon_eks_worker_node_policy: Refreshing state... [id=ml-platform-dev-ng-20251107084424450100000003/arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy]
module.eks_cluster.aws_iam_role_policy_attachment.node_group_amazon_ssm_managed_instance_core[0]: Refreshing state... [id=ml-platform-dev-ng-20251107084424450100000003/arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore]
module.eks_cluster.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=ml-platform-dev-cluster-20251107084424449600000002/arn:aws:iam::aws:policy/AmazonEKSClusterPolicy]
module.security.data.aws_caller_identity.current: Read complete after 0s [id=984479408136]
module.networking.module.vpc.data.aws_caller_identity.current[0]: Read complete after 0s [id=984479408136]
module.container_registry.aws_ecr_lifecycle_policy.this: Refreshing state... [id=ml-platform-api]
module.networking.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-08d5be8c294def947]
module.networking.aws_security_group.vpc_endpoints: Refreshing state... [id=sg-0649779911242c79e]
module.networking.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0cbedfc18a7cb1504]
module.networking.module.vpc.aws_cloudwatch_log_group.flow_log[0]: Refreshing state... [id=/aws/vpc-flow-log/vpc-0b28cd11901077bed]
module.networking.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0f3b163dd6c42977f]
module.networking.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0581f8b231b85610b]
module.eks_cluster.module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0bc07a41d993fe03f]
module.networking.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0b072b47ed33e75cb]
module.eks_cluster.module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-06cbfde16551edb9f]
module.networking.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-023f6f8bd183715f1]
module.networking.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-069b47da28fb709ea]
module.networking.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-06381a8f015282e7e]
module.networking.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0a662ceb577046bab]
module.networking.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-08c3f20f05e29e318]
module.networking.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-03c43aaf09a5d5aa8]
module.networking.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0d59eaf7fdf6f2ce4]
module.networking.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-02fb298daa06fc716]
module.networking.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-023f6f8bd183715f11080289494]
module.networking.module.vpc.aws_flow_log.this[0]: Refreshing state... [id=fl-08c3e80a9eb8fcdcc]
module.networking.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.networking.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 1s [id=506894606]
module.networking.module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=arn:aws:iam::984479408136:policy/vpc-flow-log-to-cloudwatch-2025110708443931220000000a]
module.networking.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-03b7ac054650813d5]
module.eks_cluster.module.eks.aws_security_group_rule.node["egress_https"]: Refreshing state... [id=sgrule-3393529018]
module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1481414802]
module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_self_all"]: Refreshing state... [id=sgrule-2486903782]
module.eks_cluster.module.eks.aws_security_group_rule.node["egress_kubelet"]: Refreshing state... [id=sgrule-1570153589]
module.eks_cluster.module.eks.aws_security_group_rule.node["egress_ntp"]: Refreshing state... [id=sgrule-2131426856]
module.eks_cluster.module.eks.aws_security_group_rule.node["egress_dns_tcp"]: Refreshing state... [id=sgrule-698715995]
module.eks_cluster.module.eks.aws_security_group_rule.node["egress_node_ports"]: Refreshing state... [id=sgrule-46176996]
module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-1101652775]
module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-4198157270]
module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_cluster_to_node_all_traffic"]: Refreshing state... [id=sgrule-1790725929]
module.eks_cluster.module.eks.aws_security_group_rule.node["egress_dns_udp"]: Refreshing state... [id=sgrule-3608107983]
module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-1583704121]
module.eks_cluster.module.eks.aws_security_group_rule.cluster["egress_nodes_ephemeral_ports_tcp"]: Refreshing state... [id=sgrule-1685426579]
module.eks_cluster.module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3686459932]
module.networking.module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20251107084424449300000001/arn:aws:iam::984479408136:policy/vpc-flow-log-to-cloudwatch-2025110708443931220000000a]
module.networking.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-05e1942344f710270]
module.networking.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-08b88cccde42030be]
module.networking.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0f0d6877668c59437]
module.networking.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0fbd3091ff38c2055]
module.networking.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-03a464da5f9a96e79]
module.networking.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-00f4f41e22813c1a3]
module.networking.aws_vpc_endpoint.ecr_api: Refreshing state... [id=vpce-02f3f8d1fbe940f6a]
module.networking.aws_vpc_endpoint.ec2: Refreshing state... [id=vpce-017bb5abee278095f]
module.networking.aws_vpc_endpoint.autoscaling: Refreshing state... [id=vpce-029b860a2bc7afdfb]
module.networking.aws_vpc_endpoint.ecr_dkr: Refreshing state... [id=vpce-02f287c14304a65d8]
module.networking.aws_vpc_endpoint.sts: Refreshing state... [id=vpce-0ffc51717574c4e9e]
module.networking.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0ddb4228afa201016]
module.eks_cluster.module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=ml-platform-dev]
module.networking.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0cbedfc18a7cb15041080289494]
module.eks_cluster.module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-066a525484cfe5b64,Environment]
module.eks_cluster.module.eks.aws_ec2_tag.cluster_primary_security_group["Cluster"]: Refreshing state... [id=sg-066a525484cfe5b64,Cluster]
module.eks_cluster.module.eks.time_sleep.this[0]: Refreshing state... [id=2025-11-07T08:54:48Z]
module.eks_cluster.module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::984479408136:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/4179F25B85412BF5DFBAA8BE4E69CDC2]
module.eks_cluster.module.eks.module.eks_managed_node_group["main"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=1444722670864172653]
module.eks_cluster.module.eks.module.eks_managed_node_group["main"].data.aws_ssm_parameter.ami[0]: Reading...
module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_launch_template.this[0]: Refreshing state... [id=lt-08fdb290be690713d]
module.eks_cluster.module.eks.module.eks_managed_node_group["main"].data.aws_ssm_parameter.ami[0]: Read complete after 0s [id=/aws/service/eks/optimized-ami/1.34/amazon-linux-2023/x86_64/standard/recommended/release_version]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks_cluster.module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "aws-ebs-csi-driver"
      + id                 = (known after apply)
      + kubernetes_version = "1.34"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.eks_cluster.module.eks.data.aws_eks_addon_version.this["coredns"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "coredns"
      + id                 = (known after apply)
      + kubernetes_version = "1.34"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.eks_cluster.module.eks.data.aws_eks_addon_version.this["kube-proxy"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "kube-proxy"
      + id                 = (known after apply)
      + kubernetes_version = "1.34"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.eks_cluster.module.eks.data.aws_eks_addon_version.this["vpc-cni"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "vpc-cni"
      + id                 = (known after apply)
      + kubernetes_version = "1.34"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.eks_cluster.module.eks.data.tls_certificate.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = "https://oidc.eks.us-west-2.amazonaws.com/id/4179F25B85412BF5DFBAA8BE4E69CDC2"
    }

  # module.eks_cluster.module.eks.aws_eks_addon.this["aws-ebs-csi-driver"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "aws-ebs-csi-driver"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "ml-platform-dev"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "us-west-2"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
        }
      + tags_all                    = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }

      + timeouts {}
    }

  # module.eks_cluster.module.eks.aws_eks_addon.this["coredns"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "coredns"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "ml-platform-dev"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "us-west-2"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
        }
      + tags_all                    = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }

      + timeouts {}
    }

  # module.eks_cluster.module.eks.aws_eks_addon.this["kube-proxy"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "kube-proxy"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "ml-platform-dev"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "us-west-2"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
        }
      + tags_all                    = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }

      + timeouts {}
    }

  # module.eks_cluster.module.eks.aws_eks_addon.this["vpc-cni"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "vpc-cni"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "ml-platform-dev"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "us-west-2"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
        }
      + tags_all                    = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }

      + timeouts {}
    }

  # module.eks_cluster.module.eks.aws_eks_cluster.this[0] will be updated in-place
  ~ resource "aws_eks_cluster" "this" {
        id                            = "ml-platform-dev"
        name                          = "ml-platform-dev"
        tags                          = {
            "Cluster"               = "ml-platform-dev"
            "Environment"           = "dev"
            "terraform-aws-modules" = "eks"
        }
        # (14 unchanged attributes hidden)

      ~ vpc_config {
          ~ public_access_cidrs       = [
              - "0.0.0.0/0",
            ]
            # (6 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.eks_cluster.module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "oidc_provider" {
        id              = "arn:aws:iam::984479408136:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/4179F25B85412BF5DFBAA8BE4E69CDC2"
        tags            = {
            "Cluster"     = "ml-platform-dev"
            "Environment" = "dev"
            "Name"        = "ml-platform-dev-eks-irsa"
        }
      ~ thumbprint_list = [
          - "06b25927c42a721631c1efd9431e648fa62e1e39",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = "AL2023_x86_64_STANDARD"
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "ml-platform-dev"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.micro",
        ]
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "ml-platform-dev-ng-"
      + node_role_arn          = "arn:aws:iam::984479408136:role/ml-platform-dev-ng-20251107084424450100000003"
      + region                 = "us-west-2"
      + release_version        = "1.34.1-20251103"
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-06381a8f015282e7e",
          + "subnet-069b47da28fb709ea",
          + "subnet-0a662ceb577046bab",
        ]
      + tags                   = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-ng"
        }
      + tags_all               = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-ng"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + version                = "1.34"

      + launch_template {
          + id      = "lt-08fdb290be690713d"
          + name    = (known after apply)
          + version = "2"
        }

      + node_repair_config (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 4
          + min_size     = 1
        }

      + update_config {
          + max_unavailable_percentage = 33
        }
    }

Plan: 5 to add, 2 to change, 0 to destroy.

Warning: Deprecated attribute

  on ../../modules/networking/vpc-endpoints.tf line 47, in resource "aws_vpc_endpoint" "ecr_api":
  47:   service_name        = "com.amazonaws.${data.aws_region.current.name}.ecr.api"

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

**Event**: `pull_request`
**Run**: [#19191527303](https://github.com/wlevan3/ml-platform-engineering-practicum/actions/runs/19191527303)
